import pusanCorrectGrammer

pusanCorrectGrammer.speller('''
 경북대학교(한자: 慶北大學校, 영어: Kyungpook National University)는 대구광역시와 경상북도에 소재한 국립대학이자, 의과대학, 치과대학, 경상대학, 수의과대학, 간호대학, 약학대학, 사범대학, IT대학, 법학전문대학원 등 단과대학과 전문대학원을 갖춘 대규모 종합대학이다.[6] 영문약칭은 KNU이다.

캠퍼스는 대구광역시 북구에 대구캠퍼스[7], 대구광역시 중구에 간호대학, 의과대학, 치과대학이 있는 동인캠퍼스[8], 경상북도 상주시에 있는 상주캠퍼스[9], 대구광역시 북구에 의과대학 의생명과학관, 칠곡경북대학교병원이 있는 칠곡메디캠퍼스[10], 경상북도 군위군[11] 등에 분산되어 있다. '경북'대학교는 대구에, '대구'대학교는 경북에 있다는 아이러니함 때문에 가끔 농담으로 많이 거론된다.

1923년에 경북도립사범학교(1929년 대구사범학교로 개칭)와 1923년에 설립된 대구의학전문학교, 1944년에 설립된 대구농업전문학교가 광복 이후, 1946년 9월에 국립대학으로 승격되어 각각 대구사범대학·대구의과대학·대구농과대학으로 개편하였다.

그리고 1951년 10월 국립 경북대학교로 통합, 개편되었다. 처음에는 5개의 단과대학(사범대학, 의과대학, 농과대학, 문리과대학, 법정대학)과 일반대학원으로 새로이 출발했다. 대학의 창학기년은 1946년으로 삼고 있으며, 개교기념일은 경북대학교 학생들의 첫 입학일인 1952년 5월 28일을 기념하여 5월 28일로 삼고 있다.

2020년 4월 1일 기준으로 17개의 단과대학과 68개 학과, 26개 학부, 1개의 일반대학원(석사과정 119개, 박사과정 108개), 1개의 전문대학원, 10개의 특수대학원으로 운영되고 있다.
''')